import { VideoItem } from "./type";

export const videos: VideoItem[] = [
  {
    title: "ما هي الحركة الوطنية وماذا تريد؟",

    description: "التدابير السياسية وحدها لا تكفي ليخرج السودان من هذه الحفرة، ولكن السودان يحتاج ايضا إلى إصلاح ثقافي",
    link: "L0SdBSe_ofc",
    image: "/video/nmbd.jpg",
    date: "18 ابريل 2024",
    author: "ابو بكر جيكوني"
  },
  {
    title: "عن أهمية الميثاق الاجتماعي",
    description: "القبيلة والجهة مخزن قسم كريمة ومساحة تربية فاضلة, يحثان على التراحم والتعارف بين الناس",
    link: "c4LI934B_-M",
    image: "paper/social-contract.jpg",
    date: "14 ابريل 2024",
    author: "هشام احمد"
  },
  {
    title: "الرؤية الاقتصادية للحركة الوطنية",
    description: "في السودان، يوجد قيمة التضامن ولكن بدلاً من التضامن في الاستهلاك فقط، دعونا نتضامن في الإنتاج أيضًا",
    link: "yjSIrCLQL9U",
    image: "/video/o.jpg",
    date: "قبل سنتين",
    author: "قاسم الظافر"
  },
  {
    title: "مشروع الدولة - الجزء الأول",
    description: "القبيلة والجهة مخزن قسم كريمة ومساحة تربية فاضلة, يحثان على التراحم والتعارف بين الناس",
    link: "c4LI934B_-M",
    image: "/video/c.png",
    date: "14 ابريل 2024",
    author: "هشام احمد"
  },
  {
    title: "مشروع الدولة - الجزء الثاني",
    description: "القبيلة والجهة مخزن قسم كريمة ومساحة تربية فاضلة, يحثان على التراحم والتعارف بين الناس",
    link: "c4LI934B_-M",
    image: "/video/c.png",
    date: "14 ابريل 2024",
    author: "هشام احمد"
  },
  {
    title: "أهمية الدين في المجال العام",
    description: "القبيلة والجهة مخزن قسم كريمة ومساحة تربية فاضلة, يحثان على التراحم والتعارف بين الناس",
    link: "UXUEB33o4GA",
    image: "/video/j.png",
    date: "14 ابريل 2024",
    author: "ابو بكر جيكوني"
  },
  {
    title: "رؤية تحليلية للتاريخ السياسي السوداني الحديث",
    description: "في السودان، يوجد قيمة التضامن ولكن بدلاً من التضامن في الاستهلاك فقط، دعونا نتضامن في الإنتاج أيضًا",
    link: "yjSIrCLQL9U",
    image: "/video/z.png",
    date: "14 ابريل 2024",
    author: "قاسم الظافر"
  },


  {
    title: "رؤية الحركة لمسألة النهضة",

    description: "التدابير السياسية وحدها لا تكفي ليخرج السودان من هذه الحفرة، ولكن السودان يحتاج ايضا إلى إصلاح ثقافي",
    link: "9uBptAA6CUA",
    image: "/video/nmbd.jpg",
    date: "18 ابريل 2024",
    author: "المقداد الهجان"
  },
  {
    title: "لماذا يحتاج السودان لحركة اجتماعية؟",
    description: "القبيلة والجهة مخزن قسم كريمة ومساحة تربية فاضلة, يحثان على التراحم والتعارف بين الناس",
    link: "c3zWKvbm1vY",
    image: "paper/social-contract.jpg",
    date: "14 ابريل 2024",
    author: "هشام احمد"
  },
  {
    title: "كيف يستعيد المجتمع سلطته",
    description: "في السودان، يوجد قيمة التضامن ولكن بدلاً من التضامن في الاستهلاك فقط، دعونا نتضامن في الإنتاج أيضًا",
    link: "WZVV8EGq2JQ",
    image: "/video/d.png",
    date: "قبل سنتين",
    author: "قاسم الظافر"
  },
  {
    title: "التيارات العلمانية وتفكيك الاسرة",

    description: "التدابير السياسية وحدها لا تكفي ليخرج السودان من هذه الحفرة، ولكن السودان يحتاج ايضا إلى إصلاح ثقافي",
    link: "yK0chPj_biY",
    image: "/video/f.png",
    date: "18 ابريل 2024",
    author: "ابو بكر جيكوني"
  },
  {
    title: "المؤاني البحرية مشكلات وحلول",

    description: "التدابير السياسية وحدها لا تكفي ليخرج السودان من هذه الحفرة، ولكن السودان يحتاج ايضا إلى إصلاح ثقافي",
    link: "FNaAYXMH3ms&ab",
    image: "/video/b.png",
    date: "18 ابريل 2024",
    author: "قاسم الظافر"
  },
  {
    title: "مناقشة كتاب النباهه والاستحمار",
    description: "في السودان، يوجد قيمة التضامن ولكن بدلاً من التضامن في الاستهلاك فقط، دعونا نتضامن في الإنتاج أيضًا",
    link: "TVo6Dxr2QgA",
    image: "/video/a.png",
    date: "14 ابريل 2024",
    author: "حسن يحي"
  }
];

export const featuredVideos = (count: number = 3) => {
  return videos.slice(0, count);
};